KU Logs V2/AirTicket-Request.xml

<s:Envelope xmlns:s="http://schemas.xmlsoap.org/soap/envelope/">
    <s:Body xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema">
        <AirTicketingReq xmlns="http://www.travelport.com/schema/air_v52_0" TraceId="c8f38268010611bc23e5-01969005035" TargetBranch="P7212436">
            <BillingPointOfSaleInfo xmlns="http://www.travelport.com/schema/common_v52_0" OriginApplication="UAPI" />
            <AirReservationLocatorCode>2N71OK</AirReservationLocatorCode>

            <AirPricingInfoRef Key="+xHzgRUqWDKAIYUxKAAAAA==" />
            <AirPricingInfoRef Key="+xHzgRUqWDKAKZUxKAAAAA==" />
            <AirPricingInfoRef Key="+xHzgRUqWDKAMaUxKAAAAA==" />

            <AirTicketingModifiers PlatingCarrier="KU">

                <AirPricingInfoRef Key="+xHzgRUqWDKAIYUxKAAAAA==" />
                <AirPricingInfoRef Key="+xHzgRUqWDKAKZUxKAAAAA==" />
                <AirPricingInfoRef Key="+xHzgRUqWDKAMaUxKAAAAA==" />

                <Commission xmlns="http://www.travelport.com/schema/common_v52_0" Level="Fare" Type="PercentBase" Percentage="7.00" />
                <FormOfPayment xmlns="http://www.travelport.com/schema/common_v52_0" Type="Cash" IsAgentType="true" />
            </AirTicketingModifiers>
        </AirTicketingReq>
    </s:Body>
</s:Envelope>